app/Views/template/v_template_admin.php

            <?php
            // Ambil data logo dari tabel tbl_koperasi menggunakan CodeIgniter 4 Query Builder
            $db = \Config\Database::connect(); // Mengambil koneksi database
            $query = $db->table('tbl_koperasi')->get();
---
SELECT *
FROM `tbl_koperasi`