app/Models/ModelLaporan.php

    public function pinjaman_all_data()
    {
        return $this->db->table('tbl_pinjaman')
            ->select('tbl_fakultas.kode_fakultas, tbl_anggota.nama_anggota, tbl_pinjaman.tanggal_pengajuan, tbl_detail_pinjaman.tanggal_detail_pinjaman, tbl_pinjaman.jumlah_pinjaman, tbl_pinjaman.bunga_pinjaman, tbl_detail_pinjaman.total_angsuran, tbl_detail_pinjaman.status_detail_pinjaman')
            ->join('tbl_anggota', 'tbl_pinjaman.id_anggota = tbl_anggota.id_anggota')
            ->join('tbl_fakultas', 'tbl_anggota.id_fakultas = tbl_fakultas.id_fakultas')
            ->join('tbl_detail_pinjaman', 'tbl_pinjaman.id_pinjaman = tbl_detail_pinjaman.id_pinjaman')
            ->orderBy('tbl_pinjaman.tanggal_pengajuan') // Mengurutkan berdasarkan tanggal_pengajuan
            ->get()
            ->getResultArray();
---
SELECT `tbl_fakultas`.`kode_fakultas`, `tbl_anggota`.`nama_anggota`, `tbl_pinjaman`.`tanggal_pengajuan`, `tbl_detail_pinjaman`.`tanggal_detail_pinjaman`, `tbl_pinjaman`.`jumlah_pinjaman`, `tbl_pinjaman`.`bunga_pinjaman`, `tbl_detail_pinjaman`.`total_angsuran`, `tbl_detail_pinjaman`.`status_detail_pinjaman`
FROM `tbl_pinjaman`
JOIN `tbl_anggota` ON `tbl_pinjaman`.`id_anggota` = `tbl_anggota`.`id_anggota`
JOIN `tbl_fakultas` ON `tbl_anggota`.`id_fakultas` = `tbl_fakultas`.`id_fakultas`
JOIN `tbl_detail_pinjaman` ON `tbl_pinjaman`.`id_pinjaman` = `tbl_detail_pinjaman`.`id_pinjaman`
ORDER BY `tbl_pinjaman`.`tanggal_pengajuan`

    public function pinjaman_telat()
    {
        return $this->db->table('tbl_pinjaman')
            ->select('tbl_fakultas.kode_fakultas, tbl_anggota.nama_anggota, tbl_pinjaman.tanggal_pengajuan, tbl_detail_pinjaman.tanggal_detail_pinjaman, tbl_pinjaman.jumlah_pinjaman, tbl_pinjaman.bunga_pinjaman, tbl_detail_pinjaman.total_angsuran, tbl_detail_pinjaman.status_detail_pinjaman')
            ->join('tbl_anggota', 'tbl_pinjaman.id_anggota = tbl_anggota.id_anggota')
            ->join('tbl_fakultas', 'tbl_anggota.id_fakultas = tbl_fakultas.id_fakultas')
            ->join('tbl_detail_pinjaman', 'tbl_pinjaman.id_pinjaman = tbl_detail_pinjaman.id_pinjaman')
            ->where('tbl_detail_pinjaman.tanggal_detail_pinjaman <', date('Y-m-d'))
            ->where('tbl_detail_pinjaman.status_detail_pinjaman !=', 'lunas') // Exclude 'lunas' status
            ->orderBy('tbl_detail_pinjaman.tanggal_detail_pinjaman')
            ->get()
            ->getResultArray();
---
SELECT `tbl_fakultas`.`kode_fakultas`, `tbl_anggota`.`nama_anggota`, `tbl_pinjaman`.`tanggal_pengajuan`, `tbl_detail_pinjaman`.`tanggal_detail_pinjaman`, `tbl_pinjaman`.`jumlah_pinjaman`, `tbl_pinjaman`.`bunga_pinjaman`, `tbl_detail_pinjaman`.`total_angsuran`, `tbl_detail_pinjaman`.`status_detail_pinjaman`
FROM `tbl_pinjaman`
JOIN `tbl_anggota` ON `tbl_pinjaman`.`id_anggota` = `tbl_anggota`.`id_anggota`
JOIN `tbl_fakultas` ON `tbl_anggota`.`id_fakultas` = `tbl_fakultas`.`id_fakultas`
JOIN `tbl_detail_pinjaman` ON `tbl_pinjaman`.`id_pinjaman` = `tbl_detail_pinjaman`.`id_pinjaman`
WHERE `tbl_detail_pinjaman`.`tanggal_detail_pinjaman` < '2023-12-11'
AND `tbl_detail_pinjaman`.`status_detail_pinjaman` != 'lunas'
ORDER BY `tbl_detail_pinjaman`.`tanggal_detail_pinjaman`