app/Models/ModelHome.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'Bendahara'
AND `password` = '81dc9bdb52d04dc20036dbd8313ed055'
AND `level` = '2'
---
    public function Login($username, $password, $level)
    {
        return $this->db->table('tbl_user')
            ->where([
                'username' => $username,
                'password' => $password,
                'level' => $level,
            ])->get()->getRowArray();