app/Models/ModelDashboard.php

SELECT COUNT(*) AS `numrows` FROM `tbl_anggota`
---
    public function total_anggota()
    {
        return $this->db->table('tbl_anggota')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_fakultas`
---
    public function total_fakultas()
    {
        return $this->db->table('tbl_fakultas')->countAll();

SELECT SUM(`tbl_jenis_simpanan`.`jumlah_jenis_simpanan`) AS `total_jumlah_simpanan`
FROM `tbl_simpanan`
JOIN `tbl_jenis_simpanan` ON `tbl_simpanan`.`id_jenis_simpanan` = `tbl_jenis_simpanan`.`id_jenis_simpanan`
---
    public function total_simpanan()
    {
        return $this->db->table('tbl_simpanan')
            ->join('tbl_jenis_simpanan', 'tbl_simpanan.id_jenis_simpanan = tbl_jenis_simpanan.id_jenis_simpanan')
            ->selectSum('tbl_jenis_simpanan.jumlah_jenis_simpanan', 'total_jumlah_simpanan')
            ->get()
            ->getRowArray();

SELECT `status_detail_pinjaman`, SUM(total_angsuran) AS total_angsuran_lunas
FROM `tbl_detail_pinjaman`
WHERE `status_detail_pinjaman` = 'lunas'
ORDER BY `id_detail_pinjaman`
---
    public function total_angsuran($lunas)
    {
        return $this->db->table('tbl_detail_pinjaman')
            ->select('status_detail_pinjaman, SUM(total_angsuran) AS total_angsuran_lunas')
            ->where('status_detail_pinjaman', $lunas)
            ->orderBy('id_detail_pinjaman')
            ->get()
            ->getResultArray();

SELECT SUM(`jumlah_pinjaman`) AS `total_jumlah_pinjaman`
FROM `tbl_pinjaman`
---
    public function total_pinjaman()
    {
        return $this->db->table('tbl_pinjaman')
            ->selectSum('jumlah_pinjaman', 'total_jumlah_pinjaman')
            ->get()
            ->getRowArray();

SELECT `tbl_fakultas`.`kode_fakultas`, `tbl_anggota`.`nama_anggota`, `tbl_pinjaman`.`tanggal_pengajuan`, `tbl_detail_pinjaman`.`tanggal_detail_pinjaman`, `tbl_pinjaman`.`jumlah_pinjaman`, `tbl_pinjaman`.`bunga_pinjaman`, `tbl_detail_pinjaman`.`total_angsuran`, `tbl_detail_pinjaman`.`status_detail_pinjaman`
FROM `tbl_pinjaman`
JOIN `tbl_anggota` ON `tbl_pinjaman`.`id_anggota` = `tbl_anggota`.`id_anggota`
JOIN `tbl_fakultas` ON `tbl_anggota`.`id_fakultas` = `tbl_fakultas`.`id_fakultas`
JOIN `tbl_detail_pinjaman` ON `tbl_pinjaman`.`id_pinjaman` = `tbl_detail_pinjaman`.`id_pinjaman`
WHERE `tbl_detail_pinjaman`.`tanggal_detail_pinjaman` < '2023-12-11'
AND `tbl_detail_pinjaman`.`status_detail_pinjaman` != 'lunas'
ORDER BY `tbl_detail_pinjaman`.`tanggal_detail_pinjaman`
---
    public function pinjaman_telat()
    {
        return $this->db->table('tbl_pinjaman')
            ->select('tbl_fakultas.kode_fakultas, tbl_anggota.nama_anggota, tbl_pinjaman.tanggal_pengajuan, tbl_detail_pinjaman.tanggal_detail_pinjaman, tbl_pinjaman.jumlah_pinjaman, tbl_pinjaman.bunga_pinjaman, tbl_detail_pinjaman.total_angsuran, tbl_detail_pinjaman.status_detail_pinjaman')
            ->join('tbl_anggota', 'tbl_pinjaman.id_anggota = tbl_anggota.id_anggota')
            ->join('tbl_fakultas', 'tbl_anggota.id_fakultas = tbl_fakultas.id_fakultas')
            ->join('tbl_detail_pinjaman', 'tbl_pinjaman.id_pinjaman = tbl_detail_pinjaman.id_pinjaman')
            ->where('tbl_detail_pinjaman.tanggal_detail_pinjaman <', date('Y-m-d'))
            ->where('tbl_detail_pinjaman.status_detail_pinjaman !=', 'lunas') // Exclude 'lunas' status
            ->orderBy('tbl_detail_pinjaman.tanggal_detail_pinjaman')
            ->get()
            ->getResultArray();