app/Models/ModelGrafik.php

SELECT SUM(`tbl_jenis_simpanan`.`jumlah_jenis_simpanan`) AS `total_jumlah_simpanan`
FROM `tbl_simpanan`
JOIN `tbl_jenis_simpanan` ON `tbl_simpanan`.`id_jenis_simpanan` = `tbl_jenis_simpanan`.`id_jenis_simpanan`
---
    public function get_total_jumlah_simpanan()
    {
        return $this->db->table('tbl_simpanan')
            ->join('tbl_jenis_simpanan', 'tbl_simpanan.id_jenis_simpanan = tbl_jenis_simpanan.id_jenis_simpanan')
            ->selectSum('tbl_jenis_simpanan.jumlah_jenis_simpanan', 'total_jumlah_simpanan')
            ->get()
            ->getRowArray();

SELECT `status_detail_pinjaman`, SUM(total_angsuran) AS total_angsuran_lunas
FROM `tbl_detail_pinjaman`
WHERE `status_detail_pinjaman` = 'lunas'
ORDER BY `id_detail_pinjaman`
---
    public function get_total_angsuran_lunas($lunas)
    {
        return $this->db->table('tbl_detail_pinjaman')
            ->select('status_detail_pinjaman, SUM(total_angsuran) AS total_angsuran_lunas')
            ->where('status_detail_pinjaman', $lunas)
            ->orderBy('id_detail_pinjaman')
            ->get()
            ->getResultArray();

SELECT SUM(`jumlah_pinjaman`) AS `total_pengeluaran`
FROM `tbl_pinjaman`
---
    public function get_total_pengeluaran()
    {
        return $this->db->table('tbl_pinjaman')
            ->selectSum('jumlah_pinjaman', 'total_pengeluaran')
            ->get()
            ->getRowArray();

SELECT YEAR(tbl_pinjaman.tanggal_pengajuan) AS tahun
FROM `tbl_pinjaman`
GROUP BY `tahun`
ORDER BY `tahun`
---
    public function tahun_pinjaman()
    {
        return $this->db->table('tbl_pinjaman')
            ->select("YEAR(tbl_pinjaman.tanggal_pengajuan) AS tahun")
            ->groupBy('tahun')
            ->orderBy('tahun')
            ->get()
            ->getResultArray();

SELECT YEAR(tanggal_pengajuan) AS tahun, SUM(jumlah_pinjaman) AS total_jumlah_pinjaman
FROM `tbl_pinjaman`
GROUP BY YEAR(tanggal_pengajuan)
ORDER BY `tahun` ASC
---
    public function data_pinjaman($tahun = null)
    {
        $query = $this->db->table('tbl_pinjaman')
            ->select('YEAR(tanggal_pengajuan) AS tahun, SUM(jumlah_pinjaman) AS total_jumlah_pinjaman')
            ->groupBy('YEAR(tanggal_pengajuan)')
            ->orderBy('tahun', 'ASC');

        if ($tahun) {
            $query->where("DATE_FORMAT(tanggal_pengajuan, '%Y')", $tahun);
        }

        return $query->get()->getResultArray();

SELECT DISTINCT YEAR(tanggal_simpanan) AS tahun_simpanan
FROM `tbl_simpanan`
ORDER BY `tahun_simpanan`
---
    public function tahun_simpanan()
    {
        return $this->db->table('tbl_simpanan')
            ->distinct()
            ->select("YEAR(tanggal_simpanan) AS tahun_simpanan")
            ->orderBy('tahun_simpanan')
            ->get()
            ->getResultArray();

SELECT DISTINCT YEAR(tanggal_simpanan) AS tahun_simpanan, `nama_jenis_simpanan`, SUM(jumlah_jenis_simpanan) AS total_simpanan
FROM `tbl_simpanan`
JOIN `tbl_jenis_simpanan` ON `tbl_simpanan`.`id_jenis_simpanan` = `tbl_jenis_simpanan`.`id_jenis_simpanan`
GROUP BY `tahun_simpanan`, `nama_jenis_simpanan`
ORDER BY `tahun_simpanan`, MIN(id_simpanan)
---
    public function data_simpanan($tahun = null)
    {
        $query = $this->db->table('tbl_simpanan')
            ->select("DISTINCT YEAR(tanggal_simpanan) AS tahun_simpanan, nama_jenis_simpanan, SUM(jumlah_jenis_simpanan) AS total_simpanan")
            ->join('tbl_jenis_simpanan', 'tbl_simpanan.id_jenis_simpanan = tbl_jenis_simpanan.id_jenis_simpanan')
            ->groupBy('tahun_simpanan, nama_jenis_simpanan')
            ->orderBy('tahun_simpanan, MIN(id_simpanan)'); // Use MIN() to match the behavior of GROUP BY

        if ($tahun) {
            $query->where("YEAR(tanggal_simpanan)", $tahun);
        }

        return $query->get()->getResultArray();