app/Models/ModelAnggota.php

SELECT *
FROM `tbl_anggota`
JOIN `tbl_fakultas` ON `tbl_fakultas`.`id_fakultas` = `tbl_anggota`.`id_fakultas`
ORDER BY `id_anggota`
---
    public function all_data()
    {
        return $this->db->table('tbl_anggota')
            ->join('tbl_fakultas', 'tbl_fakultas.id_fakultas = tbl_anggota.id_fakultas')
            ->orderBy('id_anggota')
            ->get()
            ->getResultArray();