app/Models/ModelKoperasi.php

    public function all_data()
    {
        return $this->db->table('tbl_koperasi')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_koperasi`