app/Models/ModelFakultas.php

SELECT *
FROM `tbl_fakultas`
ORDER BY `id_fakultas`
---
    public function all_data()
    {
        return $this->db->table('tbl_fakultas')
            ->orderBy('id_fakultas')
            ->get()
            ->getResultArray();