app/Models/ModelBunga.php

    public function all_data()
    {
        return $this->db->table('tbl_bunga')
            ->orderBy('id_bunga')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_bunga`
ORDER BY `id_bunga`